# PathOfTravelCalculationServerIds Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravelCalculationServerIds Class
Members See Also
---
Ids for external servers implementing path of travel calculations.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public static class PathOfTravelCalculationServerIds
```

Visual Basic
---
```text
Public NotInheritable Class PathOfTravelCalculationServerIds
```

Visual C++
---
```text
public ref class PathOfTravelCalculationServerIds abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..PathOfTravelCalculationServerIds
# See Also
PathOfTravelCalculationServerIds Members
Autodesk.Revit.DB.Analysis Namespace